Documents/ТребованиеНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ТребованиеНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ТребованиеНакладная/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстаткиНоменклатуры Расход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Материалы Цикл
		
		ТекущаяНоменклатура = ТекСтрокаТовары.Номенклатура;
		ОсталосьСписать = ТекСтрокаТовары.Количество;
		Партия = 0;
		Сумма = 0;
		
		//Если в текущей строке количество = 0, тогда переход к следующей строке
		Если ОсталосьСписать = 0 Тогда
			Продолжить;
		КонецЕсли;
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|	ОстаткиНоменклатурыОстатки.Партия КАК Партия,
			|	ОстаткиНоменклатурыОстатки.СуммаОстаток КАК СуммаОстаток
			|ИЗ
			|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
			|			&Дата,
			|			Склад = &СкладДокумента
			|				И Номенклатура = &Номенклатура) КАК ОстаткиНоменклатурыОстатки
			|
			|УПОРЯДОЧИТЬ ПО
			|	Партия";
		
		Граница = Новый Граница(МоментВремени(), ВидГраницы.Исключая); // Момент времени	
		
		Запрос.УстановитьПараметр("Дата", Граница);
		Запрос.УстановитьПараметр("Номенклатура", ТекущаяНоменклатура);
		Запрос.УстановитьПараметр("СкладДокумента", СкладСписания);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		//Если запрос пустой, то текущего товара на остатках нет совсем
		Если РезультатЗапроса.Пустой() Тогда
			Сообщить("Товара " + ТекущаяНоменклатура + " на остатках нет.");	
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
		
		//Цикл по таблице из запроса
		Для каждого ТекСтрокаВыборка из ВыборкаДетальныеЗаписи Цикл
			
			//Если больше не нужно списывать, то выходим
			Если ОсталосьСписать = 0 Тогда
				Продолжить
			КонецЕсли;
			
			//Если в первой партии есть нужное количество, то списываем из нее
			Если ОсталосьСписать <= ТекСтрокаВыборка.КоличествоОстаток Тогда
				Сумма = ТекСтрокаВыборка.СуммаОстаток;
				Партия = ТекСтрокаВыборка.Партия;
				//Делаем движения если все хорошо
				Движение = Движения.ОстаткиНоменклатуры.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
				Движение.Склад = СкладСписания;
				Движение.Партия = Партия;
				Движение.Количество = ОсталосьСписать;  
				Цена = Сумма / ТекСтрокаВыборка.КоличествоОстаток;
				Движение.Сумма = ОсталосьСписать * Цена;	
				ОсталосьСписать = 0;
			//Если нужно двигаться по партиям, приходим сюда
			Иначе
				Сумма = ТекСтрокаВыборка.СуммаОстаток;
				Партия = ТекСтрокаВыборка.Партия;
				ОсталосьСписать = ОсталосьСписать - ТекСтрокаВыборка.КоличествоОстаток;
				Движение = Движения.ОстаткиНоменклатуры.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
				Движение.Склад = СкладСписания;
				Движение.Партия = Партия;
				Движение.Количество = ТекСтрокаВыборка.КоличествоОстаток;
				Движение.Сумма = Сумма;								
			КонецЕсли;							
		КонецЦикла;
					
		Если ОсталосьСписать > 0 Тогда
			Отказ = Истина;
			Сообщить("Товара " + ТекущаяНоменклатура + " не хватает.");
			Продолжить; 
		КонецЕсли;
		
	КонецЦикла;
	
	// регистр ОстаткиНоменклатуры Приход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаПродукция Из Продукция Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПродукция.Номенклатура;
		Движение.Склад = СкладПоступления;
		Движение.Партия = ЭтотОбъект.Ссылка;
		Движение.Количество = ТекСтрокаПродукция.Количество;
		Движение.Сумма = 0;
	КонецЦикла;

КонецПроцедуры
